In [1]:
import numpy as np
import pandas as pd

<h1>Pandas DataFrame</h1>

In [2]:
pd.DataFrame(np.array([[1,2,3,4,5],[6,7,8,9,10]]))

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [3]:
df = pd.DataFrame([pd.Series(np.arange(6)), pd.Series(np.arange(6,12))])
df

   0  1  2  3   4   5
0  0  1  2  3   4   5
1  6  7  8  9  10  11

In [4]:
s1 = pd.Series([1,2,3,4,5,6])
s2 = pd.Series([7,8,9,10,11,12])
print(s1)
print(s2)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
0     7
1     8
2     9
3    10
4    11
5    12
dtype: int64

In [5]:
df = pd.DataFrame({'Boys':s1, 'Girls':s2})

In [6]:
df

   Boys  Girls
0     1      7
1     2      8
2     3      9
3     4     10
4     5     11
5     6     12

In [7]:
data = {'Name': ['Farhan', 'Ali', 'Khadim Hussain', 'Saad Hussain'], 'Age':[22, 23, 25,24], 
        'Grade':['C', 'B', 'A+','A']}
data = pd.DataFrame(data)
data

             Name  Age Grade
0          Farhan   22     C
1             Ali   23     B
2  Khadim Hussain   25    A+
3    Saad Hussain   24     A

In [8]:
df = pd.DataFrame(np.array([[1,2,3,4,5],[6,7,8,9,0]]))
df

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  0

In [9]:
df = pd.DataFrame(np.array([1,2,3,4]), columns=['boys'])

In [10]:
np.array([1,2,3,4])

array([1, 2, 3, 4])

In [11]:
sr = pd.Series([1,2,3,4,5])
sr2 = pd.Series([6,7,8,9,0])
print(sr)
print(sr2)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    6
1    7
2    8
3    9
4    0
dtype: int64

In [12]:
df = pd.DataFrame({'B':sr, 'G':sr2})
df1 = pd.DataFrame([sr, sr2])

print(df1)
print('...................')
print(df)

   0  1  2  3  4
0  1  2  3  4  5
1  6  7  8  9  0
...................
   B  G
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0

In [13]:
df = pd.DataFrame(np.array([[1,2],[3,4]]), columns = ['Boys', 'Girls'])
df

   Boys  Girls
0     1      2
1     3      4

In [14]:
df = pd.DataFrame(np.array([[1,2,3,4],[5,6,7,8]]), index=['Apples', 'Bananas'], 
                  columns=['s','m','t','w'])
df

         s  m  t  w
Apples   1  2  3  4
Bananas  5  6  7  8

In [15]:
print(sr)
print(sr2)
sr1 = pd.Series([11,22,33])
print(sr1)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    6
1    7
2    8
3    9
4    0
dtype: int64
0    11
1    22
2    33
dtype: int64

In [16]:
df = pd.DataFrame({'B':sr,'G':sr2, 'Z':sr1})
df

   B  G     Z
0  1  6  11.0
1  2  7  22.0
2  3  8  33.0
3  4  9   NaN
4  5  0   NaN

In [17]:
dat = {'States':['Punjab','Sindh','Blochistan'], 'Year':[2000,2003,2004], 'Pop':[5,3,1]}

In [18]:
data = pd.DataFrame(dat)
data

       States  Year  Pop
0      Punjab  2000    5
1       Sindh  2003    3
2  Blochistan  2004    1

<p>In case, We want any columns to see at 1st position by creating a new column of existing DataFrame, It will not change the origin one(Mean will not inplace )</p>

In [19]:
pd.DataFrame(data, columns=['year', 'Pop', 'States'])

   year  Pop      States
0   NaN    5      Punjab
1   NaN    3       Sindh
2   NaN    1  Blochistan

<p>  if we write column name incorrect it will give a NAN to that column, See in above example we put 'year' instead of "Year" </p>

In [20]:
data.Year

0    2000
1    2003
2    2004
Name: Year, dtype: int64

In [21]:
data['Year']

0    2000
1    2003
2    2004
Name: Year, dtype: int64

In [22]:
#f you pass a column that isn’t contained in the dict(debt), it will appear with missing values
# in the result:
print(data)
da = pd.DataFrame(dat, columns=['Year', 'States', 'Pop', 'death'], index=['one','Two','Three'])

       States  Year  Pop
0      Punjab  2000    5
1       Sindh  2003    3
2  Blochistan  2004    1

In [23]:
da

       Year      States  Pop death
one    2000      Punjab    5   NaN
Two    2003       Sindh    3   NaN
Three  2004  Blochistan    1   NaN

In [24]:
da.death = 100
da

       Year      States  Pop  death
one    2000      Punjab    5    100
Two    2003       Sindh    3    100
Three  2004  Blochistan    1    100

In [25]:
da.death = np.arange(0,2) #we must use da['death'] = np.arange(0,2)

ValueError: Length of values (2) does not match length of index (3)

In [26]:
da['death'] = np.arange(3)

In [27]:
da

       Year      States  Pop  death
one    2000      Punjab    5      0
Two    2003       Sindh    3      1
Three  2004  Blochistan    1      2

In [28]:
val = pd.Series([2,5], index=['one','Two'])
val

one    2
Two    5
dtype: int64

In [29]:
da.death = val

In [30]:
da

       Year      States  Pop  death
one    2000      Punjab    5    2.0
Two    2003       Sindh    3    5.0
Three  2004  Blochistan    1    NaN

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year':  [2000, 2001, 2002, 2001, 2002, 2003],
        'pop':   [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [32]:
val = pd.Series([20.1,2,3,20,80,21], index=[1,2,4,5,6,7])
val

1    20.1
2     2.0
4     3.0
5    20.0
6    80.0
7    21.0
dtype: float64

In [33]:
frame = pd.DataFrame(data, columns=['year', 'state', 'pop', 'death'])

In [34]:
frame

   year   state  pop death
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [35]:
frame.death = val

In [36]:
frame

   year   state  pop  death
0  2000    Ohio  1.5    NaN
1  2001    Ohio  1.7   20.1
2  2002    Ohio  3.6    2.0
3  2001  Nevada  2.4    NaN
4  2002  Nevada  2.9    3.0
5  2003  Nevada  3.2   20.0

In [37]:
frame['eastern'] = frame.state == 'Ohio'

In [38]:
frame

   year   state  pop  death  eastern
0  2000    Ohio  1.5    NaN     True
1  2001    Ohio  1.7   20.1     True
2  2002    Ohio  3.6    2.0     True
3  2001  Nevada  2.4    NaN    False
4  2002  Nevada  2.9    3.0    False
5  2003  Nevada  3.2   20.0    False

In [45]:
frame['state'] = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']
frame['GreaterthanTwo']  = frame['pop']>2
frame

   year   state  pop  death  eastern  GreaterthanTwo
0  2000    Ohio  1.5    NaN     True           False
1  2001    Ohio  1.7   20.1     True           False
2  2002    Ohio  3.6    2.0     True            True
3  2001  Nevada  2.4    NaN    False            True
4  2002  Nevada  2.9    3.0    False            True
5  2003  Nevada  3.2   20.0    False            True

In [46]:
del frame['GreaterthanTwo']
frame

   year   state  pop  death  eastern
0  2000    Ohio  1.5    NaN     True
1  2001    Ohio  1.7   20.1     True
2  2002    Ohio  3.6    2.0     True
3  2001  Nevada  2.4    NaN    False
4  2002  Nevada  2.9    3.0    False
5  2003  Nevada  3.2   20.0    False

In [50]:
#Another common form of data is a nested dict of dicts:
data = {'Ohio':{2012:2, 2013:5}, 'Nevada':{2012:4, 2013:6}}
data =  pd.DataFrame(data)
data

      Ohio  Nevada
2012     2       4
2013     5       6

In [51]:
data.T

        2012  2013
Ohio       2     5
Nevada     4     6

In [52]:
students = {'name':['farhan', 'ali', 'faraz', 'hassan',], 'AI':[75,65,80,90], 'Python':[80,60,75,80],
           'git':[90,75,87,90], 'Numpy':[97,78,95,60]}
students = pd.DataFrame(students)
students

     name  AI  Python  git  Numpy
0  farhan  75      80   90     97
1     ali  65      60   75     78
2   faraz  80      75   87     95
3  hassan  90      80   90     60

In [53]:
students['Total Marks'] = students['AI']+students['Python']+students['git']+students['Numpy']
students

     name  AI  Python  git  Numpy  Total Marks
0  farhan  75      80   90     97          342
1     ali  65      60   75     78          278
2   faraz  80      75   87     95          337
3  hassan  90      80   90     60          320

In [54]:
students['Persentage'] = students['Total Marks']/400*100

In [56]:
students

     name  AI  Python  git  Numpy  Total Marks  Persentage
0  farhan  75      80   90     97          342       85.50
1     ali  65      60   75     78          278       69.50
2   faraz  80      75   87     95          337       84.25
3  hassan  90      80   90     60          320       80.00

In [63]:
students['Grades'] = ['A+' if p>80.0 else 'A' if p>70.0 else 'B' if p>60.0 else 'C' for p in students['Persentage']]

In [64]:
students

     name  AI  Python  git  Numpy  Total Marks  Persentage Grades
0  farhan  75      80   90     97          342       85.50     A+
1     ali  65      60   75     78          278       69.50      B
2   faraz  80      75   87     95          337       84.25     A+
3  hassan  90      80   90     60          320       80.00      A